{
  "name": "hpcc-scale-test",
  "type": [
    "terraform_v1.0"
  ],
  "location": "us-east",
  "resource_group": "Default",
  "description": "",
  "tags": ["hpcc", "scale"],
  "template_repo": {
    "url": "https://github.com/IBM/ibm-spectrum-scale-ibm-cloud-schematics"
  },
  "template_data": [
    {
      "folder": ".",
      "type": "terraform_v1.0",
      "env_values":[
        { 
          "TF_CLI_ARGS_apply": "-parallelism=250"
        },
        { 
          "TF_CLI_ARGS_plan": "-parallelism=250"
        },
        {
          "TF_CLI_ARGS_destroy": "-parallelism=100"
        },
        { 
          "VAR1":"<val1>"
        },
        {
          "VAR2":"<val2>"
        } 
      ],
      "variablestore": [
        {
          "name": "vpc_region",
          "value": "Please fill here",
          "type": "string",
          "secure": false,
          "description": "Name of the IBM Cloud region where the resources need to be provisioned.(Examples: us-east, us-south, etc.) For more information, see [Region and data center locations for resource deployment](https://cloud.ibm.com/docs/overview?topic=overview-locations)."
        },
        {
          "name": "vpc_availability_zones",
          "value": "Please fill here",
          "type": "list(string)",
          "secure": false,
          "description": "IBM Cloud availability zone names within the selected region where the Spectrum Scale cluster should be deployed.For the current release, the solution supports only a single availability zone.For more information, see [Region and data center locations for resource deployment](https://cloud.ibm.com/docs/overview?topic=overview-locations)."
        },
        {
          "name": "resource_prefix",
          "value": "spectrum-scale",
          "type": "string",
          "secure": false,
          "description": "Prefix that is used to name the IBM Cloud resources that are provisioned to build the Spectrum Scale cluster. Make sure that the prefix is unique since you cannot create multiple resources with the same name. The maximum length of supported characters is 64."
        },
        {
          "name": "resource_group",
          "value": "default",
          "type": "string",
          "secure": false,
          "description":"Resource group name from your IBM Cloud account where the VPC resources should be deployed. For more information, see[Managing resource groups](https://cloud.ibm.com/docs/account?topic=account-rgs&interface=ui)."
        },
        {
          "name": "vpc_cidr_block",
          "value": "[\"10.241.0.0/18\"]",
          "type": "list(string)",
          "secure": false,
          "description": "IBM Cloud VPC address prefixes that are needed for VPC creation. Since the solution supports only a single availability zone, provide one CIDR address prefix for VPC creation. For more information, see [Bring your own subnet](https://cloud.ibm.com/docs/vpc?topic=vpc-configuring-address-prefixes)."
        },
        {
          "name": "vpc_storage_cluster_private_subnets_cidr_blocks",
          "value": "[\"10.241.1.0/24\"]",
          "type": "list(string)",
          "secure": false,
          "description": "The CIDR block that's required for the creation of the storage cluster private subnet. Modify the CIDR block if it has already been reserved or used for other applications within the VPC or conflicts with any on-premises CIDR blocks when using a hybrid environment. Provide only one CIDR block for the creation of the storage subnet."
        },
        {
          "name": "vpc_compute_cluster_private_subnets_cidr_blocks",
          "value": "[\"10.241.0.0/24\"]",
          "type": "list(string)",
          "secure": false,
          "description": "The CIDR block that's required for the creation of the compute cluster private subnet. Modify the CIDR block if it has already been reserved or used for other applications within the VPC or conflicts with anyon-premises CIDR blocks when using a hybrid environment. Provide only one CIDR block for the creation of the compute subnet."
        },
        {
          "name": "vpc_compute_cluster_dns_domain",
          "value": "compscale.com",
          "type": "string",
          "secure": false,
          "description": "IBM Cloud DNS Services domain name to be used for the compute cluster.."
        },
        {
          "name": "vpc_storage_cluster_dns_domain",
          "value": "strgscale.com",
          "type": "string",
          "secure": false,
          "description": "IBM Cloud DNS Services domain name to be used for the storage cluster."
        },
        {
          "name": "remote_cidr_blocks",
          "value": "Please fill here",
          "type": "list(string)",
          "secure": false,
          "description": "Comma-separated list of IP addresses that can be access the Spectrum Scale cluster Bastion node through SSH. For the purpose of security, provide the public IP address(es) assigned to the device(s) authorized to establish SSH connections. (Example : [\"169.45.117.34\"])  To fetch the IP address of the device, use [https://ipv4.icanhazip.com/](https://ipv4.icanhazip.com/)."
        },
        {
          "name": "bastion_osimage_name",
          "value": "ibm-ubuntu-20-04-3-minimal-amd64-2",
          "type": "string",
          "secure": false,
          "description": "Name of the image that will be used to provision the Bastion node for the Spectrum Scale cluster. Only Ubuntu stock image of any version available to the IBM Cloud account in the specific region are supported."
        },
        {
          "name": "bootstrap_osimage_name",
          "value": "hpcc-scale-bootstrap-v2-1",
          "type": "string",
          "secure": false,
          "description": "Name of the custom image that you would like to use to create the Bootstrap node for the Spectrum Scale cluster. The solution supports only the default custom image that has been provided."
        },
        {
          "name": "bastion_vsi_profile",
          "value": "cx2-2x4",
          "type": "string",
          "secure": false,
          "description": "The virtual server instance profile type name to be used to create the Bastion node. For more information, see [Instance Profiles](https://cloud.ibm.com/docs/vpc?topic=vpc-profiles)."
        },
        {
          "name": "bastion_key_pair",
          "value": "Please fill here",
          "type": "string",
          "secure": false,
          "description": "Name of the SSH key configured in your IBM Cloud account that is used to establish a connection to the Bastion and Bootstrap nodes. Make Ensure that the SSH key is present in the same resource group and region where the cluster is being provisioned. If you do not have an SSH key in your IBM Cloud account, create one by using the [SSH keys](https://cloud.ibm.com/docs/vpc?topic=vpc-ssh-keys) instructions."
        },
        {
          "name": "bootstrap_vsi_profile",
          "value": "bx2-8x32",
          "type": "string",
          "secure": false,
          "description": "The virtual server instance profile type name to be used to create the Bootstrap node. For more information, see [Instance Profiles](https://cloud.ibm.com/docs/vpc?topic=vpc-profiles&interface=ui)."
        },
        {
          "name": "ibm_customer_number",
          "value": null,
          "type": "string",
          "secure": true,
          "description": "The IBM Customer Number (ICN) that is used for the Bring Your Own License (BYOL) entitlement check. Note: An ICN is not required if the storage_type selected is evaluation. For more information on how to find your ICN, see [What is my IBM Customer Number (ICN)?](https://www.ibm.com/support/pages/what-my-ibm-customer-number-icn)."
        },
        {
          "name": "compute_cluster_filesystem_mountpoint",
          "value": "/gpfs/fs1",
          "type": "string",
          "secure": false,
          "description": "Spectrum Compute cluster (accessing Cluster) file system mount point. The accessingCluster is the cluster that accesses the owningCluster. For more information, see [Mounting a remote GPFS file system](https://www.ibm.com/docs/en/spectrum-scale/5.1.4?topic=system-mounting-remote-gpfs-file)."
        },
        {
          "name": "storage_cluster_filesystem_mountpoint",
          "value": "/gpfs/fs1",
          "type": "string",
          "secure": false,
          "description": "Spectrum Scale storage cluster (owningCluster) file system mount point. The owningCluster is the cluster that owns and serves the file system to be mounted. For information, see[Mounting a remote GPFS file system](https://www.ibm.com/docs/en/spectrum-scale/5.1.4?topic=system-mounting-remote-gpfs-file)."
        },
        {
          "name": "filesystem_block_size",
          "value": "4M",
          "type": "string",
          "secure": false,
          "description": "File system [block size](https://www.ibm.com/docs/en/spectrum-scale/5.1.4?topic=considerations-block-size). Spectrum Scale supported block sizes (in bytes) include: 256K, 512K, 1M, 2M, 4M, 8M, 16M."
        },
        {
          "name": "compute_vsi_profile",
          "value": "bx2-2x8",
          "type": "string",
          "secure": false,
          "description": "The virtual server instance profile type name to be used to create the compute cluster nodes. For more information, see [Instance Profiles](https://cloud.ibm.com/docs/vpc?topic=vpc-profiles&interface=ui)."
        },
        {
          "name": "compute_cluster_key_pair",
          "value": "Please fill here",
          "type": "string",
          "secure": false,
          "description": "Name of the SSH key configured in your IBM Cloud account that is used to establish a connection to the Compute cluster nodes. Make sure that the SSH key is present in the same resource group and region where the cluster is provisioned. The solution supports only one ssh key that can be attached to compute nodes. If you do not have an SSH key in your IBM Cloud account, create one by using the [SSH keys](https://cloud.ibm.com/docs/vpc?topic=vpc-ssh-keys) instructions."
        },
        {
          "name": "compute_cluster_gui_username",
          "value": "Please fill here",
          "type": "string",
          "secure": false,
          "description": "GUI username to perform system management and monitoring tasks on the compute cluster. The Username should be at least 4 characters, (any combination of lowercase and uppercase letters)."
        },
        {
          "name": "compute_cluster_gui_password",
          "value": "Please fill here",
          "type": "string",
          "secure": false,
          "description": "Password that is used for logging in to the compute cluster through the GUI. The password should contain a minimum of eight characters.  For a strong password, use a combination of uppercase and lowercase letters, one number and a special character. Make sure that the password doesn't contain the username."
        },
        {
          "name": "storage_vsi_profile",
          "value": "bx2d-32x128",
          "type": "string",
          "secure": false,
          "description": "Specify the virtual server instance profile type name to be used to create the Storage nodes. For more information, see [Instance Profiles](https://cloud.ibm.com/docs/vpc?topic=vpc-profiles)."
        },
        {
          "name": "total_compute_cluster_instances",
          "value": "3",
          "type": "number",
          "secure": false,
          "description": "Total number of compute cluster instances that you need to provision. A minimum of three nodes and a maximum of 64 nodes are supported."
        },
        {
          "name": "total_storage_cluster_instances",
          "value": "4",
          "type": "number",
          "secure": false,
          "description": "Total number of storage cluster instances that you need to provision. A minimum of three nodes and a maximum of 18 nodes are supported if the storage type selected is scratch. A minimum of three nodes and a maximum of 10 nodes are supported if the storage type selected is persistent."
        },
        {
          "name": "compute_vsi_osimage_name",
          "value": "hpcc-scale5141-rhel79-v2-1",
          "type": "string",
          "secure": false,
          "description": "Name of the image that you would like to use to create the compute cluster nodes for the IBM Spectrum Scale cluster. The solution supports both stock and custom images that use RHEL7.9 and 8.4 versions that have the appropriate Spectrum Scale functionality. If you'd like, you can follow the instructions for [Planning for custom images](https://cloud.ibm.com/docs/vpc?topic=vpc-planning-custom-images)to create your own custom image."
        },
        {
          "name": "storage_vsi_osimage_name",
          "value": "hpcc-scale5141-rhel84-v2-1",
          "type": "string",
          "secure": false,
          "description": "Name of the image that you would like to use to create the storage cluster nodes for the IBM Spectrum Scale cluster. The solution supports both stock and custom images that use RHEL8.4 version and that have the appropriate Spectrum Scale functionality. If you'd like, you can follow the instructions for [Planning for custom images](https://cloud.ibm.com/docs/vpc?topic=vpc-planning-custom-images) create your own custom image."
        },
        {
          "name": "storage_cluster_key_pair",
          "value": "Please fill here",
          "type": "string",
          "secure": false,
          "description": "Name of the SSH key configured in your IBM Cloud account that is used to establish a connection to the Storage cluster nodes. Make sure that the SSH key is present in the same resource group and region where the cluster is provisioned. The solution supports only one SSH key that can be attached to the storage nodes. If you do not have an SSH key in your IBM Cloud account, create one by using the [SSH keys](https://cloud.ibm.com/docs/vpc?topic=vpc-ssh-keys) instructions."
        },
        {
          "name": "storage_cluster_gui_username",
          "value": "Please fill here",
          "type": "string",
          "secure": false,
          "description": "GUI username to perform system management and monitoring tasks on the storage cluster. Note: Username should be at least 4 characters, (any combination of lowercase and uppercase letters)."
        },
        {
          "name": "storage_cluster_gui_password",
          "value": "Please fill here",
          "type": "string",
          "secure": false,
          "description": "Password that is used for logging in to the storage cluster through the GUI. The password should contain a minimum of 8 characters. For a strong password, use a combination of uppercase and lowercase letters, one number, and a special character. Make sure that the password doesn't contain the username."
        },
        {
          "name": "storage_type",
          "value": "scratch",
          "type": "string",
          "secure": false,
          "description": "Select the Spectrum Scale file system deployment method. Note: The Spectrum Scale scratch and evaluation type deploys the Spectrum Scale file system on virtual server instances, and the persistent type deploys the Spectrum Scale file system on bare metal servers. The persistent Spectrum Scale storage feature is a beta feature that is available for prototyping and testing purposes. There are no warranties, SLAs, or support provided for persistent storage and it is not intended for production use."
        },
        {
          "name": "storage_bare_metal_server_profile",
          "value": "cx2d-metal-96x192",
          "type": "string",
          "secure": false,
          "description": "Specify the bare metal server profile type name to be used to create the bare metal storage nodes. For more information, see [bare metal server profiles](https://cloud.ibm.com/docs/vpc?topic=vpc-bare-metal-servers-profile&interface=ui)."
        },
        {
          "name": "storage_bare_metal_osimage_name",
          "value": "ibm-redhat-8-4-minimal-amd64-3",
          "type": "string",
          "secure": false,
          "description": "Name of the image that you would like to use to create the storage cluster nodes for the Spectrum Scale cluster. The solution supports only a RHEL 8.4 stock image."
        }
      ]
    }
  ]
}
